In [4]:
import pandas as pd 
df = pd.read_csv('Marks_data.csv')
print(df.head())

   STUDENT_ID    Name  Math  Science  English  Total            Grade
0           1  Felice    79       54     63.4  201.3          website
1           2  Ruthie    29       24     26.9   15.4          product
2           3  Nickie    85       10     51.5   39.6              hub
3           4   Paule    91       48     97.9   37.2  standardization
4           5  Ruthie    46       71     21.1  114.2      application

In [34]:
df.fillna(value = 0,inplace=True)

In [35]:
df.isnull() #checking null

     STUDENT_ID   Name   Math  Science  English  Total  Grade
0         False  False  False    False    False  False  False
1         False  False  False    False    False  False  False
2         False  False  False    False    False  False  False
3         False  False  False    False    False  False  False
4         False  False  False    False    False  False  False
..          ...    ...    ...      ...      ...    ...    ...
995       False  False  False    False    False  False  False
996       False  False  False    False    False  False  False
997       False  False  False    False    False  False  False
998       False  False  False    False    False  False  False
999       False  False  False    False    False  False  False

[1000 rows x 7 columns]

In [7]:
df['Total'] = df[['Math','Science','English']].sum(axis=1)
print(df)

     STUDENT_ID       Name  Math  Science  English  Total            Grade
0             1     Felice    79       54     63.4  196.4          website
1             2     Ruthie    29       24     26.9   79.9          product
2             3     Nickie    85       10     51.5  146.5              hub
3             4      Paule    91       48     97.9  236.9  standardization
4             5     Ruthie    46       71     21.1  138.1      application
..          ...        ...   ...      ...      ...    ...              ...
995         996    Hershel    70       30     11.3  111.3  disintermediate
996         997  Georgiana    38       91     73.7  202.7       background
997         998       Nell    81       49     12.1  142.1         systemic
998         999      Denys    16       49     39.0  104.0        challenge
999        1000   Alphonse    46       69     69.6  184.6          circuit

[1000 rows x 7 columns]

In [8]:
import pandas as pd

# Read the CSV file into a DataFrame
df = pd.read_csv('Marks_data.csv')

# Print the first few rows of the DataFrame
print(df.head())

# Print the details of a specific student by index
# For example, to print the details of the student at index 2
student_index = 2
print(df.loc[student_index])

   STUDENT_ID    Name  Math  Science  English  Total            Grade
0           1  Felice    79       54     63.4  201.3          website
1           2  Ruthie    29       24     26.9   15.4          product
2           3  Nickie    85       10     51.5   39.6              hub
3           4   Paule    91       48     97.9   37.2  standardization
4           5  Ruthie    46       71     21.1  114.2      application
STUDENT_ID         3
Name          Nickie
Math              85
Science           10
English         51.5
Total           39.6
Grade            hub
Name: 2, dtype: object

In [10]:
df['Total'] = df[['Math','Science','English']].sum(axis=1)
df[['Name', 'Math','Science','English','Total']].head()

     Name  Math  Science  English  Total
0  Felice    79       54     63.4  196.4
1  Ruthie    29       24     26.9   79.9
2  Nickie    85       10     51.5  146.5
3   Paule    91       48     97.9  236.9
4  Ruthie    46       71     21.1  138.1

In [17]:
def assign_grade(total):
    if total >=250:
        return 'A'
    elif total >=200:
        return 'B'
    elif total >=150:
        return 'C'
    else:
        return 'D'
print(assign_grade(300))
print("---------------------")
df['Grade'] = df['Total'].apply(assign_grade)
 
print(df[['Name','Total','Grade']])

A
---------------------
          Name  Total Grade
0       Felice  196.4     C
1       Ruthie   79.9     D
2       Nickie  146.5     D
3        Paule  236.9     B
4       Ruthie  138.1     D
..         ...    ...   ...
995    Hershel  111.3     D
996  Georgiana  202.7     B
997       Nell  142.1     D
998      Denys  104.0     D
999   Alphonse  184.6     C

[1000 rows x 3 columns]

In [18]:
df[['Name','Total','Grade']].tail()

          Name  Total Grade
995    Hershel  111.3     D
996  Georgiana  202.7     B
997       Nell  142.1     D
998      Denys  104.0     D
999   Alphonse  184.6     C

In [20]:
grade_a_students=df[df['Grade']=='A']
print(grade_a_students)

     STUDENT_ID        Name  Math  Science  English  Total Grade
27           28       Lisha    93       95     67.1  255.1     A
50           51   Mackenzie    89       99     62.1  250.1     A
94           95      Belvia    92       98     78.0  268.0     A
118         119        Inga    84       83     90.5  257.5     A
119         120       Wenda    88       69     94.3  251.3     A
188         189      Mollee    75       98     95.6  268.6     A
246         247     Wilfrid    78      100     95.9  273.9     A
279         280  Georgeanna    93       92     66.5  251.5     A
295         296       Eddie    86       87     91.8  264.8     A
298         299     Keriann    83      100     83.8  266.8     A
319         320     Merrili    86       94     94.2  274.2     A
356         357       Grete    94       99     59.4  252.4     A
503         504       Marve    80       98     83.8  261.8     A
512         513        Oona    68       89     97.7  254.7     A
517         518       Hynda    92       65     94.7  251.7     A
619         620      Ailsun    92       89     93.0  274.0     A
622         623     Basilio   100       97     69.5  266.5     A
634         635     Vassili    88       94     85.7  267.7     A
690         691       Perla    99      100     78.3  277.3     A
750         751        Chad   100       67     94.1  261.1     A
780         781      Gerard    99       94     67.7  260.7     A
897         898       Dasya    85       94     87.2  266.2     A
951         952         Ted    96       90     96.5  282.5     A
970         971      Kristi    72       97     83.7  252.7     A

In [21]:
grade_a_students=df[df['Grade']=='B']
print('No Of Studentssecured grade B:',len(grade_a_students))

No Of Studentssecured grade B: 149

In [22]:
print('Total No Of Student failed:' , len(df[df['Grade']=='D']))

Total No Of Student failed: 518

In [29]:
Math_max = max(df['Math'])
print(Math_max)

100

In [30]:
print(df[df['Math'] == Math_max])

     STUDENT_ID      Name  Math  Science  English  Total Grade
315         316     Susie   100       48     36.7  184.7     C
326         327    Sallee   100        6     15.2  121.2     D
342         343    Indira   100       28     83.1  211.1     B
406         407  Maybelle   100       15     10.4  125.4     D
454         455   Justino   100       48     58.9  206.9     B
462         463   Eleanor   100       25      9.0  134.0     D
622         623   Basilio   100       97     69.5  266.5     A
750         751      Chad   100       67     94.1  261.1     A
854         855   Abigael   100       48     60.6  208.6     B
987         988      Isac   100       78     54.3  232.3     B

In [32]:
df.to_csv("result.csv",index=False)
print("File is Created")

File is Created